src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Enums/ТипыИзмеряемыхВеличин/ТипыИзмеряемыхВеличин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзмеряемыхВеличин</name>
  <enumValues>
    <name>Вес</name>
  </enumValues>
  <enumValues>
    <name>Объем</name>
  </enumValues>
  <enumValues>
    <name>Площадь</name>
  </enumValues>
  <enumValues>
    <name>Длина</name>
  </enumValues>
  <enumValues>
    <name>КоличествоШтук</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
    <comment>Выбирается программно, </comment>
  </enumValues>
  <enumValues>
    <name>Мощность</name>
  </enumValues>
  <enumValues>
    <name>Энергия</name>
  </enumValues>
  <enumValues>
    <name>ЭлектрическийЗаряд</name>
  </enumValues>
  <enumValues>
    <name>Время</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/НаборыУпаковок/НаборыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыУпаковок</name>
  <predefined>
    <items>
      <name>БазовыеЕдиницыИзмерения</name>
      <description>Базовые единицы измерения</description>
    </items>
    <items>
      <name>ИндивидуальныйДляНоменклатуры</name>
      <description>Индивидуальный набор для номенклатуры</description>
    </items>
  </predefined>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/ManagerModule.bsl
Функция ПолучитьДанныеКлассификатора() Экспорт
	ТД = Новый ТекстовыйДокумент;
	ТД = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");
	ТекстМакета = ТД.ПолучитьТекст();		
	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстМакета);	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;		
		Если Параметры.Свойство("Ключ")	И Параметры.Ключ.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда 				
			ВыбраннаяФорма = "ФормаЭлементаУпаковка";
		ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И Параметры.ЗначениеКопирования.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда
			ВыбраннаяФорма = "ФормаЭлементаУпаковка";
		ИначеЕсли Параметры.Свойство("ПараметрыВыбора") и
			((Параметры.ПараметрыВыбора.Свойство("Владелец") и ТипЗнч(Параметры.ПараметрыВыбора.Владелец) = Тип("СправочникСсылка.НаборыУпаковок")) Или 
			(Параметры.ПараметрыВыбора.Свойство("ТипИзмеряемойВеличины") и Параметры.ПараметрыВыбора.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка)) Тогда  			
			ВыбраннаяФорма = "ФормаЭлементаУпаковка";	
		Иначе
			ВыбраннаяФорма = "ФормаЭлементаЕдиница";	
		КонецЕсли;
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущаяСтрока = Неопределено; 		
		Если Параметры.Свойство("ТекущаяСтрока", ТекущаяСтрока) Тогда
			Владелец = ТекущаяСтрока.Владелец;
		ИначеЕсли Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
			Владелец = Параметры.Отбор.Владелец;	
		Иначе
			Владелец = Неопределено;
		КонецЕсли;		
		Если Владелец = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения Тогда
			ВыбраннаяФорма = "ФормаСпискаЕдиниц";
		Иначе
			ВыбраннаяФорма = "ФормаСпискаУпаковок";
		КонецЕсли;		
		Если Владелец <> Неопределено Тогда			
			Если Не Параметры.Свойство("Отбор") Тогда
				Параметры.Вставить("Отбор", Новый Структура);
			КонецЕсли;			
			Параметры.Отбор.Вставить("Владелец", Владелец);			
		КонецЕсли;
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
		СтандартнаяОбработка = Ложь;
		ТипИзмеряемойВеличины = Неопределено;		
		Если Параметры.Свойство("Отбор") и 
			(Параметры.Отбор.Свойство("ТипИзмеряемойВеличины", ТипИзмеряемойВеличины) Или Параметры.Свойство("ТипИзмеряемойВеличины", ТипИзмеряемойВеличины)) Тогда
			Если ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда
				ВыбраннаяФорма = "ФормаВыбораУпаковки";
			Иначе
				ВыбраннаяФорма = "ФормаВыбораЕдиницы";
			КонецЕсли;
		//ИначеЕсли (Параметры.Свойство("Номенклатура") и Не (Параметры.Свойство("ВсегдаВыбиратьЕдиницуИзмерения") и Не ЗначениеЗаполнено(Параметры.Номенклатура))) Или
		//	(Параметры.Свойство("НоменклатураОприходование") и Не (Параметры.Свойство("ВсегдаВыбиратьЕдиницуИзмерения") и Не ЗначениеЗаполнено(Параметры.НоменклатураОприходование))) Тогда 
			//ВыбраннаяФорма = "ФормаВыбораИзДокументов";
			//Если Параметры.Свойство("НоменклатураОприходование") Тогда
			//	Параметры.Вставить("Номенклатура", Параметры.НоменклатураОприходование);	
			//КонецЕсли;			
			//СтандартнаяОбработка = Ложь;	
		Иначе
			ВыбраннаяФорма = "ФормаВыбораЕдиницы";
			Если Не Параметры.Свойство("Отбор") Тогда
				Параметры.Вставить("Отбор", Новый Структура);
			КонецЕсли;
			Мас = Новый Массив;
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Вес);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Объем);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Площадь);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Длина);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Мощность);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Энергия);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Время);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.ПустаяСсылка());
			Параметры.Отбор.Вставить("ТипИзмеряемойВеличины", Мас);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Функция СформироватьНаименование(ТипУпаковки, Единица, Числитель, Знаменатель, ЕдиницаВладельца) Экспорт	
	Если ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Разупаковка Тогда
		Возврат СокрЛП(СокрЛП(Единица) + " (" + Формат(Числитель, "ЧРД=.") + "/" + Формат(Знаменатель, "ЧРД=.") + " " + СокрЛП(ЕдиницаВладельца) + ")");
	ИначеЕсли ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.ТоварноеМесто Тогда
		Возврат "";		
	ИначеЕсли Числитель <> 0 И Знаменатель <> 0 Тогда 
		Возврат СокрЛП(СокрЛП(Единица) + " (" + Формат(Числитель / Знаменатель, "ЧРД=.") + " " + СокрЛП(ЕдиницаВладельца) + ")");
	Иначе 
		Возврат "";
	КонецЕсли;
КонецФункции
